validation/kernel-6.12.25/vanilla-fair/sysbench_fileio.txt
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      725.51
    writes/s:                     483.67
    fsyncs/s:                     1550.98

Throughput:
    read, MiB/s:                  11.34
    written, MiB/s:               7.56

General statistics:
    total time:                          30.0141s
    total number of events:              82733

Latency (ms):
         min:                                    0.00
         avg:                                    0.36
         max:                                   16.42
         95th percentile:                        1.55
         sum:                                29833.80

Threads fairness:
    events (avg/stddev):           82733.0000/0.00
    execution time (avg/stddev):   29.8338/0.00